Revit 2015 API
ImageType.Path Property
 The original image file path used if the image is loaded from a disk file, or empty if the image is generated by Revit internally, such as save a view to an image.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public string Path { get; }
Visual Basic
Public ReadOnly Property Path As String
	Get
Visual C++
public:
property String^ Path {
	String^ get ();
}
Remarks
 This path will be used when Reload() is called, and also be checked when ReloadFrom() is called.
See Also
ImageType Class
Autodesk.Revit.DB Namespace